In [1]:
import pandas as pd

In [2]:
pwd

'/home/correa/Escritorio/Proyectos/Congreso2019'

ls

Leer el archivo .csc

In [4]:
dataframe = pd.read_csv('personas.csv')

In [5]:
dataframe

    NOMBRE          APELLIDOS  EDAD  SALARIO
0  ANTONIO        PEREZ GOMEZ    34    20000
1     LUIS  RODRIGUEZ VAZQUEZ    45    45000
2     ROSA     MARTINEZ LOPEZ    25    15000
3    PEDRO     SILVA GONZALEZ    54    50000
4    MARIA         DIAZ LOPEZ    40    32000

Para obtener información del dataframe

In [7]:
dataframe.describe()

            EDAD       SALARIO
count   5.000000      5.000000
mean   39.600000  32400.000000
std    10.968136  15208.550227
min    25.000000  15000.000000
25%    34.000000  20000.000000
50%    40.000000  32000.000000
75%    45.000000  45000.000000
max    54.000000  50000.000000

Obtener elementos de una columna

In [9]:
dataframe['NOMBRE']

0    ANTONIO
1       LUIS
2       ROSA
3      PEDRO
4      MARIA
Name: NOMBRE, dtype: object

Seleccionar un elemento de la tabla

In [10]:
dataframe['NOMBRE'][0]

'ANTONIO'

Seleccion de más de 1 columna

In [14]:
dataframe[['NOMBRE','EDAD']]

    NOMBRE  EDAD
0  ANTONIO    34
1     LUIS    45
2     ROSA    25
3    PEDRO    54
4    MARIA    40

In [15]:
dataframe['SALARIO'] > 30000

0    False
1     True
2    False
3     True
4     True
Name: SALARIO, dtype: bool

Filtramos datos del dataframe

In [12]:
filtro = dataframe['SALARIO'] > 30000

In [16]:
dataframe2 = dataframe[filtro]

In [18]:
dataframe2

  NOMBRE          APELLIDOS  EDAD  SALARIO
1   LUIS  RODRIGUEZ VAZQUEZ    45    45000
3  PEDRO     SILVA GONZALEZ    54    50000
4  MARIA         DIAZ LOPEZ    40    32000

Convertir en un Array

In [20]:
dataframe.values

array([['ANTONIO', 'PEREZ GOMEZ', 34, 20000],
       ['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['ROSA', 'MARTINEZ LOPEZ', 25, 15000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

Acceder a un elemento del array

In [23]:
array = dataframe.values

In [24]:
array[0,0]

'ANTONIO'